In [1]:
person={
    "first":"Corey",
    "last":"Schafer",
    "email":"CoreyMSchafer@gmail.com"
}

In [2]:
people={
    "first":["Corey"],
    "last":["Schafer"],
    "email":["CoreyMSchafer@gmail.com"]
}

In [3]:
people={
    "first":["Corey",'Jane','John'],
    "last":["Schafer",'Doe','Doe'],
    "email":["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]
}

In [4]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']

In [5]:
import pandas as pd
df=pd.DataFrame(people)

In [6]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [7]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [8]:
type(df['email'])

pandas.core.series.Series

In [9]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [10]:
df[['last','email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JohnDoe@gmail.com

In [11]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [12]:
df.iloc[0] #with iloc we can search by integer location

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [13]:
df.iloc[[0,1]] #Rows

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [14]:
df.iloc[[0,1],2] #rows&columns in argument

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [16]:
df.loc[0]      #with loc we can search by label

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [17]:
df.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [18]:
df.loc[[0,1],'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [19]:
df.loc[[0,1],['email','last']] #see email is first and last name is last

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@gmail.com      Doe

In [20]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
2          JohnDoe@gmail.com
Name: email, dtype: object

In [21]:
df.set_index('email')

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [23]:
df.set_index('email',inplace=True)

In [24]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [25]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [26]:
df.loc['CoreyMSchafer@gmail.com']

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [27]:
df.loc['CoreyMSchafer@gmail.com','last']

'Schafer'

In [28]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [29]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [30]:
filt=df['last']=='Doe'

In [31]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [32]:
df[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [33]:
df.loc[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [34]:
df.loc[filt,'email']

1    JaneDoe@gmail.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [35]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [36]:
filt=(df['last']=='Doe') & (df['first']=='John')

In [37]:
filt

0    False
1    False
2     True
dtype: bool

In [38]:
df.loc[filt,'email']

2    JohnDoe@gmail.com
Name: email, dtype: object

In [39]:
filt=(df['last']=='Doe') | (df['first']=='John')

In [40]:
filt

0    False
1     True
2     True
dtype: bool

In [41]:
df.loc[~filt, 'email']

0    CoreyMSchafer@gmail.com
Name: email, dtype: object

In [42]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [43]:
df.columns=['email','first_name','last_name']

In [44]:
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [45]:
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [46]:
df.columns=[x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [47]:
df.columns=df.columns.str.replace(' ','_')
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [48]:
df.columns=[x.lower() for x in df.columns]  #lowercase
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [54]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [55]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [56]:
df.loc[2]

email    JohnDoe@gmail.com
first                 John
last                   Doe
Name: 2, dtype: object

In [62]:
df.loc[2]=['John','Smith','JohnSmith@gmail.com']

In [64]:
df

                     email  first                 last
0  CoreyMSchafer@gmail.com  Corey              Schafer
1        JaneDoe@gmail.com   Jane                  Doe
2                     John  Smith  JohnSmith@gmail.com

In [65]:
df.loc[2,['last','email']]

last     JohnSmith@gmail.com
email                   John
Name: 2, dtype: object

In [66]:
df.loc[2,['last','email']]=['Doe','JohnDoe@gmail.com']

In [67]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com  Smith      Doe

In [80]:
df.loc[2,['last','email']]=['Doe','JohnDoe@gmail.com']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com  Smith      Doe

In [84]:
df.loc[2,['first','email']]=['John','JohnDoe@gmail.com']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith
3                      NaN    NaN    Smith

In [85]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=False)

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith
3                      NaN    NaN    Smith

In [86]:
df.loc[2,'last']='Smith'

In [87]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith
3                      NaN    NaN    Smith

In [91]:
 df=df.iloc[:3]

In [92]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith

In [93]:
df.at[2,'last']='Doe'

In [94]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [95]:
filt=(df['email']=='JohnDoe@gmail.com')
df[filt]

               email first last
2  JohnDoe@gmail.com  John  Doe

In [96]:
filt=(df['email']=='JohnDoe@gmail.com')
df[filt]['last']

2    Doe
Name: last, dtype: object

In [97]:
df[filt]['last']='Smith'

C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [98]:
df           #it did not change to smith

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [99]:
df.loc[filt,'last']='Smith'

C:\Users\Manish\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)
C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [100]:
df #now it did change to smith

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith

In [101]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@gmail.com
2          johndoe@gmail.com
Name: email, dtype: object

In [102]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John    Smith

In [103]:
df['email']=df['email'].str.lower()

C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [104]:
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        johndoe@gmail.com   John    Smith

In [105]:
#apply
#map
#applymap
#replace

In [106]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [107]:
def update_email(email):
    return email.upper()

In [108]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [109]:
df['email']=df['email'].apply(update_email)

C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [110]:
df

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Corey  Schafer
1        JANEDOE@GMAIL.COM   Jane      Doe
2        JOHNDOE@GMAIL.COM   John    Smith

In [112]:
df['email']=df['email'].apply(lambda x: x.lower())

C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [113]:
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        johndoe@gmail.com   John    Smith

In [114]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [115]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [116]:
len(df['email'])

3

In [117]:
df.apply(len, axis='rows')

email    3
first    3
last     3
dtype: int64

In [118]:
df.apply(pd.Series.min)

email    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

In [119]:
df.apply(lambda x:x.min())

email    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

In [120]:
df.applymap(len)

   email  first  last
0     23      5     7
1     17      4     3
2     17      4     5

In [121]:
df.applymap(str.lower)

                     email  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@gmail.com   jane      doe
2        johndoe@gmail.com   john    smith

In [122]:
df['first'].map({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [123]:
df['first'].replace({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [124]:
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@gmail.com   Jane      Doe
2        johndoe@gmail.com   John    Smith

In [125]:
df['first']+' '+df['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [126]:
df['Full_Name']=df['first']+' '+df['last']

C:\Users\Manish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [127]:
df

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        johndoe@gmail.com   John    Smith     John Smith

In [128]:
df.drop(columns=['first','last'])

                     email      Full_Name
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@gmail.com       Jane Doe
2        johndoe@gmail.com     John Smith

In [131]:
df['Full_Name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: Full_Name, dtype: object

In [132]:
df['Full_Name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [133]:
df[['first','last']]=df['Full_Name'].str.split(' ',expand=True)

C:\Users\Manish\Anaconda3\lib\site-packages\pandas\core\frame.py:3391: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

In [134]:
df

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        johndoe@gmail.com   John    Smith     John Smith

In [141]:
df.append({'first':'Tony',
           'last':'Montana',
           'email':'tonymontana@gmail.com',
          'Full_Name':'Tony Montana'},ignore_index=True)

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        johndoe@gmail.com   John    Smith     John Smith
3    tonymontana@gmail.com   Tony  Montana   Tony Montana

In [142]:
people={
    "first":['Tony','Steve'],
    "last":['Stark','Rogers'],
    "email":['IronMan@avenge.com','Cap@avenge.com']
}
df2=pd.DataFrame(people)

In [143]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [144]:
df=df.append(df2,ignore_index=True,sort=False)

In [145]:
df

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        johndoe@gmail.com   John    Smith     John Smith
3       IronMan@avenge.com   Tony    Stark            NaN
4           Cap@avenge.com  Steve   Rogers            NaN

In [147]:
df.drop(index=4)

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
1        janedoe@gmail.com   Jane      Doe       Jane Doe
2        johndoe@gmail.com   John    Smith     John Smith
3       IronMan@avenge.com   Tony    Stark            NaN

In [148]:
df.drop(index=df[df['last']=='Doe'].index)

                     email  first     last      Full_Name
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
2        johndoe@gmail.com   John    Smith     John Smith
3       IronMan@avenge.com   Tony    Stark            NaN
4           Cap@avenge.com  Steve   Rogers            NaN

In [151]:
df.sort_values(by='last', ascending=True)

                     email  first     last      Full_Name
1        janedoe@gmail.com   Jane      Doe       Jane Doe
4           Cap@avenge.com  Steve   Rogers            NaN
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
2        johndoe@gmail.com   John    Smith     John Smith
3       IronMan@avenge.com   Tony    Stark            NaN

In [156]:
df.sort_values(by=['last','first'], ascending=False)

                     email  first     last      Full_Name
3       IronMan@avenge.com   Tony    Stark            NaN
2        johndoe@gmail.com   John    Smith     John Smith
0  coreymschafer@gmail.com  Corey  Schafer  Corey Schafer
4           Cap@avenge.com  Steve   Rogers            NaN
1        janedoe@gmail.com   Jane      Doe       Jane Doe

In [157]:
people={
    "first":["Corey",'Jane','John','Adam'],
    "last":["Schafer",'Doe','Doe','Doe'],
    "email":["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com","A@gmail.com"]
}

In [158]:
import pandas as pd
df=pd.DataFrame(people)

In [159]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
3   Adam      Doe              A@gmail.com

In [160]:
df.sort_values(by=['last','first'], ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
3   Adam      Doe              A@gmail.com

In [162]:
df.sort_values(by=['last','first'], ascending=[False,True],inplace=True)

In [163]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [164]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
3   Adam      Doe              A@gmail.com

In [168]:
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object